Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.AddImperialProfileToTree(Tekla.Structures.Catalogs.ParametricProfileItem)
Adds a parametric profile to the tree.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.GetListOfParameters(System.String,System.String[]@)
Gets the parameters from the ParameterString.